class questionsList {
    questionArr = [
        ["我會按照最嚴謹的倫理守則做事", "PTR_C"],
        ["我做事非常可靠", "PTR_C"],
        ["我做事向來條理分明", "PTR_C"],
        ["我總是會一絲不苟地，按照計畫完成目標", "PTR_C"],
        ["我很少衝動的做事", "PTR_C"],
        ["我會精確的掌握事情的細節", "PTR_C"],
        ["我的朋友都說我是一個細心的人", "PTR_C"],
        ["即使別人對我不友善，我依然會對他保持禮貌", "PTR_A"],
        ["朋友都認為我是友善的人", "PTR_A"],
        ["我不容易對朋友生氣", "PTR_A"],
        ["在團隊中我會盡一切可能維持彼此的和諧", "PTR_A"],
        ["當別人惹我生氣時，我會盡可能不讓他發現", "PTR_A"],
        ["我極少與他人起衝突", "PTR_A"],
        ["別人覺得我是一個能接受新事物的人", "PTR_O"],
        ["我總會在工作中提出許多創新的提案", "PTR_O"],
        ["我非常有創造力", "PTR_O"],
        ["在同事之中我是個很有點子的人", "PTR_O"],
        ["我喜歡工作內容多變化的工作", "PTR_O"],
        ["我熱愛體驗、學習新的事物", "PTR_O"],
        ["工作上的壓力容易影響我的情緒", "PTR_ES"],
        ["我是個情緒起伏比較大的人", "PTR_ES"],
        ["當我的工作出錯時，我會感到相當焦慮", "PTR_ES"],
        ["我時常擔心事情不如我的預期", "PTR_ES"],
        ["我對工作上無法掌握的事容易感到焦慮", "PTR_ES"],
        ["我在社交場合中感到很自在", "PTR_E"],
        ["在聚會中我會主動與人攀談", "PTR_E"],
        ["朋友都認為我是活潑的人", "PTR_E"],
        ["我能夠自在地跟第一次見面的人聊天", "PTR_E"],
        ["上台演講對我來說不是難事", "PTR_E"]
    ]

    dimensionMap = {
        "PTR_C":7,
        "PTR_A":6,
        "PTR_O":6,
        "PTR_ES":5,
        "PTR_E":5
    }
}

export default new questionsList();